# Графический интерфейс для NLP-анализа текстовых данных "BindWord XP"

## Описание
**BindWord XP** - десктопное приложение для NLP-анализа текстовых данных, созданное на основе, основанное на существующем *Python*/*Spacy* скрипте, и возможностью обработки текста.
**Цель проекта** - создание рабочего десктопного оффлайн приложения с графическом интерфейсом.
## Актуальность
Многие люди при работе с большим объемом информации сталкиваются со снижением продуктивности и риском ошибок из-за ручного анализа, который занимает много времени. Отсутствие программного обеспечения для анализа больших объемов текстовых данных создает значительные трудности для пользователей.
## Задачи
Для достижения цели поставлены следующие задачи:
- определение необходимого функционала для целевой аудитории;
- написание графического интерфейса;
- оптимизация кода;
- дополнение функционала;
- тестирование и публикация бинарных файлов и исходного кода.
## Журнал прогресса

| Дата от    | Дата до    | Задача                                                     |
| ---------- | ---------- | ---------------------------------------------------------- |
| 05.02.2025 | 12.02.2025 | Выяснение актуальности                                     |
| 12.02.2025 | 19.02.2025 | Постановки цели и задач                                    |
| 19.02.2025 | 26.02.2025 | Выбор технологии проекта                                   |
| 26.02.2025 | 12.03.2025 | Составление стека и изучение технологии                    |
| 12.03.2025 | 19.03.2025 | Создание документации                                      |
| 19.03.2025 | 19.03.2025 | **Первая презентация проекта**                             |
| 19.03.2025 | 27.04.2025 | Декомпозиция кода библиотеке *Spacy*                       |
| 27.03.2025 | 02.04.2025 | Создание различных вариантов дизайна приложения            |
| 02.04.2025 | 09.04.2025 | Создание чернового варианта оконного приложения на *PyQT6* |
| 09.04.2025 | 16.04.2025 | Выбор итогового дизайна и имплементация в приложения       |
| 16.04.2025 | 23.04.2025 | Съёмка видео-отчёта по проектной деятельности              |
